/* Дана целочисленная прямоугольная матрица:

m = {{  16,  78,   0,   30, -29,  19, -52, -54, -88,  51},

    { -79, -22,  32,  49, -62, -69,  -2,  99, -75,  89},

    { -87,  95, -22, -28, -49, -75,  76,  73, -59, -52},

    {  30,  49, -28, -48,   0,  57,  -6, -85,   0, -18},

    { -99, -21, -95,   0,  22,  -2,  69, -67,  -1, -71},

    { -25,  47,  72,  57,  15, -44,  44, -87,   4,  74},

    {  88, -61,   0,  -6, -83,  97,   0,  85,  15,   8},

    { -54,  99,  73, -85, -67, -87,  85, -93, -70,  10},

    {  98,  58, -10,   0,  95,  62,  77, -70,  36, -32},

    {  78,  60, -79, -18,  30, -13, -34,  10,   1, -38}}

Определить:

      1) такие k что k-тая строка совпадает с k-тым столбцом;

      2) сумму элементов, в тех строках, которые содержат хотя бы один отрицательный элемент. */

#include <iostream>
using namespace std;

int main()
{
	setlocale(LC_ALL,"Russian");
	int i,j,flag(1),sum;
	bool flag2;
	int m[10][10] = {{  16,  78,   0,   30, -29,  19, -52, -54, -88,  51},
	{ -79, -22,  32,  49, -62, -69,  -2,  99, -75,  89},
    { -87,  95, -22, -28, -49, -75,  76,  73, -59, -52},
    {  30,  49, -28, -48,   0,  57,  -6, -85,   0, -18},
    { -99, -21, -95,   0,  22,  -2,  69, -67,  -1, -71},
    { -25,  47,  72,  57,  15, -44,  44, -87,   4,  74},
    {  88, -61,   0,  -6, -83,  97,   0,  85,  15,   8},
    { -54,  99,  73, -85, -67, -87,  85, -93, -70,  10},
    {  98,  58, -10,   0,  95,  62,  77, -70,  36, -32},
    {  78,  60, -79, -18,  30, -13, -34,  10,   1, -38}};
	/* Определить такие k что k-тая строка совпадает с k-тым столбцом */
	for(i=0;i<10;i++)
	{
		for(j=0;j<10;j++)
		{
			if(m[i][j] == m[j][i])
			{}
			else flag = 0;
		}
		if(flag==1) cout << "k = " << i+1 << "\n";
		flag = 1;
	}
	/* Определить сумму элементов, в тех строках, которые содержат хотя бы один отрицательный элемент */
	for(i=0;i<10;i++)
	{
		flag2 = false; sum = 0;
		for(j=0;j<10;j++)
		{
			if(m[i][j]<0) flag2 = true;
			sum += m[i][j];
		}
		if(flag2) cout << "Строка номер " << i << ", сумма = " << sum << "\n";
	}
	system("pause");
	return 0;
}